# Curve Overlap Point Point Property

Source: https://www.revitapidocs.com/2026/0682c43e-e055-6dca-b088-83adf8aa9d20.htm

---

| Curve Overlap Point Point Property |
| --- |

The 3D coordinate of the point.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public XYZ Point { get; }
```

```
Public ReadOnly Property Point As XYZ
	Get
```

```
public:
property XYZ^ Point {
	XYZ^ get ();
}
```

```
member Point : XYZ with get
```

#### Property Value

XYZ See Also

#### Reference

CurveOverlapPoint Class Autodesk.Revit.DB Namespace